---
kind: method
id: M:Autodesk.Revit.DB.FamilyParameterSet.Erase(Autodesk.Revit.DB.FamilyParameter)
source: html/2bf50cc0-b824-9e5a-ef89-749ce13f0fae.htm
---
# Autodesk.Revit.DB.FamilyParameterSet.Erase Method

## Syntax (C#)
```csharp
public virtual int Erase(
	FamilyParameter item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.FamilyParameter`)